; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	image0 - mode
	spectrograph2 - mode
	image3 - mode
	image1 - mode
	GroundStation0 - direction
	Star4 - direction
	Star3 - direction
	Star2 - direction
	GroundStation1 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph2)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 image1)
	(supports instrument4 spectrograph2)
	(supports instrument4 image3)
	(calibration_target instrument4 Star3)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument7 image1)
	(supports instrument7 image3)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
)
(:goal (and
	(pointing satellite3 Star3)
	(have_image Star5 spectrograph2)
	(have_image Star6 spectrograph2)
	(have_image Planet7 image0)
	(have_image Planet8 image0)
))

)

; plan
1. (turn_to satellite3 star3 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star3)
   goals met: 1 of 5
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 5
3. (calibrate satellite2 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 1 of 5
4. (turn_to satellite2 planet8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet8)
   goals met: 1 of 5
5. (take_image satellite2 planet8 instrument5 image0)
   added: (have_image planet8 image0)
   goals met: 2 of 5
6. (turn_to satellite2 planet7 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet7)
   goals met: 2 of 5
7. (take_image satellite2 planet7 instrument5 image0)
   added: (have_image planet7 image0)
   goals met: 3 of 5
8. (turn_to satellite2 star5 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star5)
   goals met: 3 of 5
9. (take_image satellite2 star5 instrument5 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 4 of 5
10. (turn_to satellite2 star6 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star6)
   goals met: 4 of 5
11. (take_image satellite2 star6 instrument5 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 5 of 5
